require_relative 'Employee'
include Emp

ivan = Employee.new("Иванов", "Иван", "Иванович", "03.04.1988", "+79957517964", "myMail@mail.ru", "Красная 12", "0315 224124", "Программист")

#Выбрасывают исключения
#fedor = Employee.new("Иванов", "Федор", "Иванович12", "03.04.1988", "+79957517964", "myMail@mail.ru", "Красная 12", "0315 224124", "Программист")
#filliph = Employee.new("Иванов", "Филипп", "Иванович", "31-04-1988", "+79957517964", "myMail@mail.ru", "Красная 12", "0315 224124", "Программист")
#dima = Employee.new("Иванов", "Дмитрий", "Иванович", "03.04.1988", "+12345", "myMail@mail.ru", "Красная 12", "0315 224124", "Программист")
#vova = Employee.new("Иванов", "Владимир", "Иванович", "03.04.1988", "+79957517964", "myMailmail.ru", "Красная 12", "0315 224124", "Программист")
#sasha = Employee.new("Иванов", "Александр", "Иванович", "03.04.1988", "+79957517964", "myMail@mail.ru", "Красная 12", "0315-2124", "Программист")